examples/OpenFOAM/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    SYMP3
    {
        type            slip;
    }

    INLE1
    {
        type            fixedValue;
        value           uniform (0.1315 0 0);
    }

    OUTL9
    {
        type            fixedValue;
        value           uniform (0 0.0177 0);
    }

    OUTL10
    {
        type            fixedValue;
        value           uniform (0 0.0177 0);
    }

    OUTL11
    {
        type            fixedValue;
        value           uniform (0 0.0177 0);
    }

    OUTL12
    {
        type            fixedValue;
        value           uniform (0 0.0177 0);
    }

    WALL6
    {
        type            translatingWallVelocity;
        U               (-0.003 0 0);
        value           uniform (-0.003 0 0);
    }

    WALL8
    {
        type            noSlip;
    }

    WALL61
    {
        type            noSlip;
    }

    WALL62
    {
        type            noSlip;
    }

    WALL63
    {
        type            noSlip;
    }

    WALL64
    {
        type            noSlip;
    }

    WALL65
    {
        type            noSlip;
    }

    WALL66
    {
        type            noSlip;
    }

    WALL67
    {
        type            noSlip;
    }

    WALL68
    {
        type            noSlip;
    }

    WALL69
    {
        type            noSlip;
    }

    WALL7
    {
        type            noSlip;
    }

    WALL70
    {
        type            noSlip;
    }

    OUTL15
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
